Repository: juliansoh/DoumentTranslator
Catalog: TranslationAssistant.DocumentTranslationInterface/Properties/Resources.*.resx
Languages: fr

# DocumentTranslator_name
source: Document Translator
fr: Traducteur des documents

# Account_title
source: Account
fr: Compte

# Account_string1
source: Please subscribe to Microsoft Translator Text API at
fr: Veuillez vous abonner à l'API Microsoft Translator Text au

# Account_string2
source: and copy the Key for your Translator Text API resource into the field below.
fr: et copiez la clé de votre ressource API pour la traduction de textes dans le champ ci-dessous.

# Account_string10
source: Optionally you may enter a category identifier to use a customized machine translation system. Enter the category ID of a custom system you have built on
fr: Vous pouvez également indiquer un identifiant de catégorie pour utiliser un système de traduction automatique personnalisé. Les catégories que vous pouvez utiliser par défaut sont « general » (s’applique si vous laissez le champ vide), « tech » pour le contenu technique lié à l’informatique, « generalnn » pour les réseaux neuraux, ou la catégorie personnalisée que vous avez construite sur

# Account_string11
source: Build a customized machine translation system here.
fr: Construire un système de traduction par machine sur mesure ici.

# Account_string3
source: Subscribe to Microsoft Translator
fr: S’abonner au Microsoft Translator

# Account_category
source: Category ID:
fr: Catégorie :

# Account_key
source: Key:
fr: Clé :

# Account_save
source: Save
fr: Enregistrer

# Advanced_string10
source: Please obtain the Server Address and the Appid to enter from the translation service administrator for your organization.
fr: Vous pouvez vous procurer l’adresse du serveur et l’Appid à entrer de l’administrateur de service de traduction pour votre organisation.

# Advanced_string11
source: Any settings made here will override entries that are present in the "Account" page.
fr: Tous paramètres appliqués ici remplaceront des entrées qui sont présentes dans la page « Compte ».

# Advanced_string20
source: Server Address:
fr: Adresse du serveur :

# Advanced_title
source: Advanced Settings
fr: Paramètres avancés

# Advanced_appid
source: Appid:
fr: ID d’application :

# Advanced_string21
source: Use these Advanced Settings instead of "Account".
fr: Utilisez ces paramètres avancés au lieu de « Compte ».

# Account_clear
source: Clear
fr: Effacer

# Appearance_colortheme
source: Color theme:
fr: Thème de couleur :

# Appearance_fontsize
source: Font size:
fr: Taille de police :

# Appearance_title
source: Appearance
fr: Apparence

# Translate_title
source: Translate Documents
fr: Traduire des Documents

# Translate_invalidcredentials
source: Invalid credentials. Please visit the Settings page first to enter your Microsoft Translator credentials.
fr: Informations d’identification non valides. Veuillez visiter la page de paramètres pour entrer vos informations d’identification pour Microsoft Translator.

# Translate_Browse
source: Browse
fr: Parcourir

# Translate_FromLanguage
source: From Language
fr: Langue de départ

# Translate_ToLanguage
source: To Language
fr: Langue d’arrivée

# Translate_Go
source: Translate
fr: OK

# Common_AutoDetect
source: Auto-Detect
fr: Détection automatique

# Common_Statustext1
source: Translation completed successfully. The translated documents contain the language identifier
fr: Traduction terminée avec succès. Les documents traduits contiennent l’identificateur de langue

# Common_Statustext2
source: in the file name.
fr: dans le nom du fichier.

# Common_SupportedFiles
source: Supported Files
fr: Fichiers pris en charge

# Common_TranslatingDocument
source: Translating document:
fr: Traduire un document :

# Error_LanguageList
source: Unable to retrieve language list from Translator service.
fr: Impossible de récupérer la liste des langues de service de traducteur.

# Error_ProcessingDocument
source: Error while processing document:
fr: Erreur lors du traitement de document :

# Home_attribution
source: Translations by Microsoft® Translator
fr: Traductions par Microsoft® Translator

# Home_string10
source: Translate Microsoft Office documents: Word | Excel | Powerpoint.
fr: Traduit des documents de la suite Microsoft Office : Word | Excel | PowerPoint.

# Home_string11
source: Translate PDF. Requires Office 2013 or later installed on this PC. PDFs will be saved as Word documents.
fr: Traduit des documents PDF : Office 2013 ou une version plus récente doit être installé sur ce PC. Les documents PDF seront enregistrés comme documents Word.

# Home_string12
source: Translate HTML, Markdown, SRT caption files, and plain text (.txt file) in UTF-8 character encoding.
fr: Traduit des fichiers HTML, SRT et texte brut (fichier .txt) en encodage de caractères UTF-8.

# Home_string13
source: Translate from any Microsoft Translator source language to any target language.
fr: Traduit de toutes les langues source à toutes les langues cible de Microsoft Translator.

# Home_string14
source: Uses your Translator Text API account, and any MT systems that have been customized using Custom Translator.
fr: Utilise votre compte Microsoft API, les données stockées dans le CTF et les systèmes de mémoire personnalisés à l’aide du Hub.

# Home_string15
source: Command line operation, wildcards and multiple languages at once using DocumentTranslatorCmd.exe.
fr: Les opérations de lignes de commandes, les caractères génériques et les traductions en plusieurs langues sont possibles à l’aide de DocumensTranslatorCmd.exe.

# Settings_About
source: About
fr: À propos de

# Common_Ready
source: Ready to translate.
fr: Prêt à traduire.

# Common_SettingsSaved
source: Settings saved. Ready to translate.
fr: Paramètres enregistrés. Prêt à traduire.

# Error_KeyInvalid
source: Key is invalid. Please visit the Azure Portal to obtain a subscription key for the Translator Text API.
fr: Key n’est pas valide. Veuillez visiter le portail Azure pour obtenir une clé d’abonnement pour l’API de texte traducteur.

# Error_PleaseSubscribe
source: Please subscribe to Microsoft Translator text API and enter your subscription key in the Settings page.
fr: Veuillez vous abonner à l'API texte de Microsoft Translator et entrer votre clé d’abonnement dans la page Paramètres.

# Main_Home
source: Home
fr: Accueil

# Main_Settings
source: Settings
fr: Paramètres

# Common_SelectDocuments
source: Please select the documents and languages to translate.
fr: Veuillez sélectionner les documents à traduire et les langues de départ et d’arrivée.

# Error_CategoryV2Invalid
source: V2: Category is invalid. Please visit https://hub.microsofttranslator.com to determine a valid category ID, leave empty, or use one of the standard categories.
fr: V2 : Catégorie n’est pas valide. S’il vous plaît visitez https://hub.microsofttranslator.com afin de déterminer un ID de catégorie valide, laissez vide, ou utilisez l’une des catégories standards.

# Error_CategoryV3Invalid
source: Category is invalid. Please visit https://portal.customtranslator.azure.ai to determine a valid category ID, leave empty, or use one of the standard categories.
fr: V3 : Catégorie n’est pas valide. S’il vous plaît visitez https://portal.customtranslator.azure.ai afin de déterminer un ID de catégorie valide, laissez vide, ou utilisez l’une des catégories standards.

# Translate_Hidden
source: Ignore hidden content
fr: Ignorer le contenu masqué

# Translate_HiddenTooltip
source: Check to skip the following content: Word documents: hidden text
fr: Cocher pour ignorer le contenu suivant : Word documents : texte masqué

# TestWindow_Title
source: Test Window
fr: Fenêtre d'essai

# Main_ImmediateWindow
source: Translate
fr: Traduire

# Translate_Input
source: Input:
fr: réaction:

# Translate_Result
source: Result:
fr: résultat:

# Translate_BreakSentences
source: Break Sentences
fr: Condamnations à briser

# Translate_Detect
source: Detect
fr: Détecter

# Translate_Mode
source: Content Type
fr: Type de contenu

# Common_PlainText
source: plain text
fr: texte brut

# Translate_SentNum
source: Number of sentences:
fr: Nombre de phrases:

# Translate_Dictionary
source: Dictionary
fr: Dictionnaire

# CustomEndpoint
source: Use container:
fr: Utiliser le conteneur

# AzureRegion_text
source: Azure Region:
fr: Région Azure
